Revit 2026 API

# EnergyDataSettingsGroundPlane Property

---

Id of level which represents ground level.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GroundPlane { get; set; }
```
```vb
Public Property GroundPlane As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ GroundPlane {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member GroundPlane : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The input element is not a level or invalidElementId. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The ground plane defines what is above and below ground for Conceptual Energy Analysis. The ground plane can optionally used for the rendering cast shadows.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace